feiyangqingyun /qtkaifajingyan

1. Когда в компиляции обнаруживается большое количество ошибок, начните с первой и устраняйте их одну за другой. Не спешите увидеть следующую ошибку. Часто последние ошибки вызваны предыдущими ошибками. Могут быть все решено
2. Таймер - хорошая вещь, научитесь его использовать, иногда с помощью одиночного таймера QTimer :: singleShot и QMetaObject :: invokeMethod можно решить неожиданные проблемы. Например, загрузка занимает много времени при инициализации формы, поэтому легко застрять на главном дисплее интерфейса, и интерфейс не будет отображаться до завершения загрузки, что приводит к очень неприятным ощущениям. Загрузка времени (иногда эти загрузки должны выполняться в основном потоке, например, при использовании окна стека QStackWidget для загрузки некоторых подформ), отложенная или асинхронная загрузка, чтобы она выполнялась после отображения интерфейса вместо основного основного интерфейса.
```cpp
//Выполнять функцию загрузки асинхронно
QMetaObject::invokeMethod(this, "load", Qt::QueuedConnection);
//Задержка 10 миллисекунд для выполнения функции загрузки
QTimer::singleShot(10, this, SLOT(load()));
```
3.QtCreator по умолчанию - это однопоточная компиляция. В начале проектирования можно подумать, что он не занимает как можно больше системных ресурсов. В настоящее время компьютеры являются многоядерными. Компилятор msvc по умолчанию - это многопоточная компиляция без ручной настройки. другие компиляторы, вам нужно установить его вручную.
- Метод 1. На этапе сборки параметров сборки каждого проекта (вы можете проверить страницу теневой сборки) добавьте строку -j16 для создания аргументов. Этот параметр будет сохранен в файле pro.user и понадобится, когда он удален Reset, этот метод не рекомендуется;
- Метод 2: Добавьте в среду комплекта сборки, Инструменты-> Параметры-> Комплекты сборки-> Выберите комплект сборки-> среда-> кнопка изменения справа-> Введите MAKEFLAGS = -j4 в открытое поле ввода, В таким образом, вам не нужно каждый раз настраивать многопоточную компиляцию, пока это проект, который использует этот набор компонентов, этот параметр компиляции будет добавлен; 
- Примечание: за -j следует количество ядер компьютера. Если вы напишете слишком много, не будет никакого эффекта. Вы должны проверить параметры компьютера или ввести -j4. Ведь 4 ядра компьютер должен быть самым основным; 
- Вероятно, новая версия QtCreator, начиная с 2019 года, будет автоматически устанавливать многопоточную компиляцию в соответствии с ядром компьютера по умолчанию. Например, если он распознает, что ваш компьютер 16-ядерный, он будет компилироваться с параметром -j16 по умолчанию ; 

4. Если вы хотите использовать QtCreator для беспрепятственного развертывания программ Android, вы должны сначала успешно настроить его в AndroidStudio, чтобы сгладить все неровности. 

5. Много раз после нахождения соответствующего метода инкапсуляции Qt не забывайте больше смотреть на перегрузку функции. Если у вас несколько параметров, вы найдете другой мир, и иногда вы внезапно поймете, что Qt уже инкапсулировал его для us, например, перегруженные параметры QString и QColor чрезвычайно богаты.

6. Вы можете записать номер версии метки + значок ico в файл pro (поддерживается только Qt5) .На самом деле, когда это qmake в Windows, эта информация будет автоматически преобразована в файл rc. 

```cpp
VERSION  = 2025.10.01
RC_ICONS = main.ico
```

7. Администратор запускает программу, ограниченную компилятором MSVC. 
```cpp
QMAKE_LFLAGS += /MANIFESTUAC:"level='requireAdministrator' uiAccess='false'" #以管理员运行
QMAKE_LFLAGS += /SUBSYSTEM:WINDOWS,"5.01" #VS2013 在XP运行
```
